## Staging: ses_receiving_emails
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                     NAME                     |
|--------|----------------------------------------------|
| add    | `aws_lambda_permission.ses_receiving_emails` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_permission.ses_receiving_emails will be created
  + resource "aws_lambda_permission" "ses_receiving_emails" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ses_receiving_emails"
      + id                  = (known after apply)
      + principal           = "ses.amazonaws.com"
      + source_account      = "239043911459"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Provider aws is undefined

  on lambda.tf line 4, in module "ses_receiving_emails":
   4:     aws = aws.us-east-1

Module module.ses_receiving_emails does not declare a provider named aws.
If you wish to specify a provider configuration for the module, add an entry
for aws in the required_providers block within the module.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-ses_receiving_emails-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-ses_receiving_emails-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.ses_receiving_emails"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
